---
kind: method
id: M:Autodesk.Revit.DB.PlanTopologySet.GetEnumerator
source: html/b764393f-84c3-6cfb-ddde-f142a9db2c87.htm
---
# Autodesk.Revit.DB.PlanTopologySet.GetEnumerator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the set.